OpenROAD 26Q2-1715-g299f30154c 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 8 thread(s).
mkdir -p ./objects/sky130hd/cnn_top/base
/OpenROAD-flow-scripts/flow/scripts/flow.sh 2_1_floorplan floorplan
Running floorplan.tcl, stage 2_1_floorplan
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/cnn_top/base/1_synth.odb
read_sdc ./results/sky130hd/cnn_top/base/1_synth.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
Master sky130_ef_sc_hd__decap_12 is loaded but not used in the design

==========================================================================
Floorplan check_setup
--------------------------------------------------------------------------
number instances in verilog is 8626
[INFO IFP-0107] Defining die area using utilization: 40.00% and aspect ratio: 1.
[WARNING IFP-0028] Core area lower left (1.000, 1.000) snapped to (1.380, 2.720).
[INFO IFP-0001] Added 183 rows of 1089 site unithd.
[INFO IFP-0100] Die BBox:  (  0.000  0.000 ) ( 503.340 503.340 ) um
[INFO IFP-0101] Core BBox: (  1.380  2.720 ) ( 502.320 500.480 ) um
[INFO IFP-0102] Core area:                       249347.894 um^2
[INFO IFP-0103] Total instances area:            100537.674 um^2
[INFO IFP-0104] Effective utilization:                0.403
[INFO IFP-0105] Number of instances:                   8626
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/make_tracks.tcl
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/fastroute.tcl
Repair tie lo fanout...
[INFO RSZ-0042] Inserted 23 tie sky130_fd_sc_hd__conb_1 instances.
Repair tie hi fanout...
[INFO RSZ-0042] Inserted 1 tie sky130_fd_sc_hd__conb_1 instances.
repair_timing -setup_margin 0 -hold_margin 0 -repair_tns 100 -match_cell_footprint -setup -skip_last_gasp -sequence unbuffer,sizeup,swap,vt_swap -verbose
[WARNING EST-0027] no estimated parasitics. Using wire load models.
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove 
[INFO RSZ-0098] No setup violations found
Default units for flow
 time 1ns
 capacitance 1pF
 resistance 1kohm
 voltage 1v
 current 1mA
 power 1nW
 distance 1um
   Layer   | Unit Resistance | Unit Capacitance 
           |       (kohm/um) |          (pF/um)
------------------------------------------------
       li1 |        7.18e-02 |         1.50e-04
      met1 |        8.93e-04 |         1.72e-04
      met2 |        8.93e-04 |         1.36e-04
      met3 |        1.57e-04 |         2.15e-04
      met4 |        1.57e-04 |         1.48e-04
      met5 |        1.78e-05 |         1.54e-04
------------------------------------------------

   Layer   | Via Resistance 
           |         (kohm) 
----------------------------
      mcon |       9.25e-03 
       via |       4.50e-03 
      via2 |       3.37e-03 
      via3 |       3.77e-04 
      via4 |       5.80e-06 
----------------------------
Report metrics stage 2, floorplan final...

==========================================================================
floorplan final report_design_area
--------------------------------------------------------------------------
Design area 100620 um^2 40% utilization.
write_db ./results/sky130hd/cnn_top/base/2_1_floorplan.odb
write_sdc -no_timestamp ./results/sky130hd/cnn_top/base/2_1_floorplan.sdc
Elapsed time: 0:03.66[h:]min:sec. CPU time: user 3.89 sys 0.28 (114%). Peak memory: 178120KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_1_floorplan             .odb            3            173 75a9eff4ca0af4198afa
2_1_floorplan             .sdc                             a2383e2f0c2c5367e114
/OpenROAD-flow-scripts/flow/scripts/flow.sh 2_2_floorplan_macro macro_place
Running macro_place.tcl, stage 2_2_floorplan_macro
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/cnn_top/base/2_1_floorplan.odb
read_sdc ./results/sky130hd/cnn_top/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
Design area 100620 um^2 40% utilization.
write_db ./results/sky130hd/cnn_top/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.52[h:]min:sec. CPU time: user 0.44 sys 0.08 (99%). Peak memory: 138240KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_2_floorplan_macro       .odb            0            135 75a9eff4ca0af4198afa
/OpenROAD-flow-scripts/flow/scripts/flow.sh 2_3_floorplan_tapcell tapcell
Running tapcell.tcl, stage 2_3_floorplan_tapcell
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/cnn_top/base/2_2_floorplan_macro.odb
read_sdc ./results/sky130hd/cnn_top/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 3330 tapcells.
Design area 104787 um^2 42% utilization.
write_db ./results/sky130hd/cnn_top/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.50[h:]min:sec. CPU time: user 0.45 sys 0.05 (99%). Peak memory: 135292KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_3_floorplan_tapcell     .odb            0            132 ccda5e7a8aa75c220db7
/OpenROAD-flow-scripts/flow/scripts/flow.sh 2_4_floorplan_pdn pdn
Running pdn.tcl, stage 2_4_floorplan_pdn
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/cnn_top/base/2_3_floorplan_tapcell.odb
read_sdc ./results/sky130hd/cnn_top/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 104787 um^2 42% utilization.
write_db ./results/sky130hd/cnn_top/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.81[h:]min:sec. CPU time: user 0.74 sys 0.07 (99%). Peak memory: 153192KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_4_floorplan_pdn         .odb            0            149 6c4e8b8079621ec1347f
cp ./results/sky130hd/cnn_top/base/2_4_floorplan_pdn.odb ./results/sky130hd/cnn_top/base/2_floorplan.odb
cp ./results/sky130hd/cnn_top/base/2_1_floorplan.sdc ./results/sky130hd/cnn_top/base/2_floorplan.sdc
