###############################################################################
# Created by write_sdc
###############################################################################
current_design cnn_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 20.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_gnt}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[0]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[10]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[11]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[12]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[13]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[14]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[15]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[16]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[17]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[18]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[19]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[1]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[20]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[21]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[22]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[23]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[24]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[25]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[26]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[27]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[28]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[29]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[2]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[30]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[31]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[3]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[4]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[5]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[6]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[7]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[8]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rdata[9]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_rvalid}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[0]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[10]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[11]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[12]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[13]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[14]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[15]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[16]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[17]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[18]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[19]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[1]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[20]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[21]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[22]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[23]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[24]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[25]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[26]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[27]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[28]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[29]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[2]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[30]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[31]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[3]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[4]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[5]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[6]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[7]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[8]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {paddr[9]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {penable}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {psel}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[0]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[10]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[11]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[12]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[13]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[14]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[15]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[16]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[17]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[18]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[19]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[1]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[20]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[21]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[22]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[23]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[24]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[25]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[26]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[27]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[28]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[29]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[2]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[30]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[31]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[3]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[4]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[5]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[6]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[7]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[8]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwdata[9]}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pwrite}]
set_input_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst_n}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {busy_o}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {done_o}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fsm_state_o[0]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fsm_state_o[1]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fsm_state_o[2]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {fsm_state_o[3]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[0]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[10]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[11]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[12]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[13]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[14]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[15]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[16]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[17]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[18]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[19]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[1]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[20]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[21]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[22]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[23]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[24]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[25]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[26]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[27]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[28]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[29]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[2]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[30]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[31]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[3]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[4]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[5]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[6]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[7]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[8]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_addr[9]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_req}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[0]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[10]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[11]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[12]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[13]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[14]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[15]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[16]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[17]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[18]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[19]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[1]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[20]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[21]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[22]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[23]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[24]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[25]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[26]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[27]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[28]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[29]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[2]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[30]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[31]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[3]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[4]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[5]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[6]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[7]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[8]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_wdata[9]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {mem_we}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[0]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[10]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[11]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[12]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[13]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[14]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[15]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[16]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[17]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[18]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[19]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[1]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[20]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[21]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[22]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[23]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[24]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[25]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[26]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[27]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[28]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[29]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[2]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[30]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[31]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[3]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[4]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[5]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[6]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[7]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[8]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {prdata[9]}]
set_output_delay 4.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pready}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
